In [1]:
import pandas as pd
from sqlalchemy import create_engine

# create a SQLAlchemy connection
engine = create_engine('mysql+pymysql://rnv_importer:rnv_importer@localhost/rnv_big_data_mining')

In [2]:
from IPython.display import display

# list of Selects
queries = [
   "SELECT COUNT(*) 'JOURNEYS' FROM journeys",
   "SELECT COUNT(*) 'LINES' FROM `lines`",
   "SELECT COUNT(*) 'LINEGROUPS' FROM linegroups",
   "SELECT COUNT(*) 'DEAD LINES' FROM `lines` WHERE id NOT IN (SELECT DISTINCT api_line FROM journeys)",
   "SELECT COUNT(*) 'STATIONS' FROM stations",
   "SELECT COUNT(*) 'DEAD STATIONS' FROM `stations` WHERE stations.api_hafasID NOT IN (SELECT DISTINCT api_station FROM stops)",
   "SELECT COUNT(*) 'STOPS' FROM stops",
   "SELECT (SUM(TIMESTAMPDIFF(SECOND , api_plannedDeparture, api_realtimeDeparture)))/60/60/24 AS 'TOTAL DELAY (DAYS)' FROM stops WHERE api_realtimeDeparture != api_plannedDeparture",
]

#executes all Selects and saves results in a DataFrame
for query in queries:
    df = pd.read_sql_query(query, engine)
    display(df)

# close connection
engine.dispose()

   JOURNEYS
0    165301

   LINES
0    875

   LINEGROUPS
0         179

   DEAD LINES
0         246

   STATIONS
0      1122

   DEAD STATIONS
0            156

     STOPS
0  3216030

   TOTAL DELAY (DAYS)
0          363.229699